# 📋 Документация модели Fraud Detection

## Модель
- **Тип:** LightGBM
- **Версия:** 1.0
- **Дата создания:** 2025-11-24 09:25:20

## Метрики производительности
- **F2-score:** 0.6358
- **Recall:** 0.6667
- **Precision:** 0.5366
- **F1-score:** 0.5946
- **ROC-AUC:** 0.9788

## Оптимальный порог классификации
- **Threshold:** 0.550

## Входные данные (Input)
Модель принимает на вход DataFrame со следующими признаками (82 признаков):

- time_until_next_tx
- user_tx_count_total
- user_min_amount_total
- time_since_last_tx
- amount
- user_id
- day_of_month
- user_max_amount_total
- month_cos
- amount_zscore_user
- amount_diff_from_user_avg
- amount_ratio_to_user_avg
- user_avg_amount_total
- month_sin
- hour_sin
- user_std_amount_total
- day_of_week
- hour
- tx_mean_amount_1h
- month
... и еще 62 признаков

**Требования:**
- Все признаки должны быть числовыми
- Пропущенные значения должны быть заполнены (рекомендуется 0)
- Признаки должны быть в том же порядке, что и в списке selected_features

## Выходные данные (Output)
Модель возвращает:
1. **Вероятность мошенничества** (float): значение от 0 до 1
   - Близко к 0: низкая вероятность мошенничества
   - Близко к 1: высокая вероятность мошенничества

2. **Класс** (int): 0 или 1
   - 0: Нормальная транзакция
   - 1: Мошенническая транзакция
   - Определяется сравнением вероятности с порогом (0.550)

## Пример использования

```python
import joblib
import pandas as pd

# Загрузка модели
model_package = joblib.load('model/model.pkl')
model = model_package['model']
selected_features = model_package['selected_features']
threshold = model_package['threshold']

# Подготовка данных
# X_new должен быть DataFrame с признаками из selected_features
X_new = pd.DataFrame(...)  # ваши данные

# Предсказание
probabilities = model.predict_proba(X_new[selected_features])[:, 1]
predictions = (probabilities >= threshold).astype(int)

# Результаты
for i, (prob, pred) in enumerate(zip(probabilities, predictions)):
    print(f"Транзакция {i}: вероятность={prob:.4f}, класс={'Мошенническая' if pred == 1 else 'Нормальная'}")
```

## Важные замечания
1. Модель обучена на данных с дисбалансом классов (~78:1)
2. Главная метрика - F2-score (фокус на Recall - не пропустить мошенника)
3. Порог классификации оптимизирован для максимизации F2-score
4. Для интерпретации результатов используйте SHAP значения (см. графики в model/)
